#pragma once

#include "global.h"
#include "proc.h"
#include "event.h"
#include "uimenu.h"
#include "bmtrap.h"
#include "muctrl.h"

struct UnkProc80855A0 {
    PROC_HEADER;
    /* 29 */ u8 _pad_29[0x4D - 0x29];
    /* 4D */ u8 unk4D;
};

struct ProcEventQuakeHandler {
    PROC_HEADER;
    /* 29 */ u8 _pad_29[0x4C - 0x29];
    /* 4C */ s8 unk4C;
};

struct Proc89EE068 {
    PROC_HEADER;
    /* 29 */ u8 _pad_29[0x54 - 0x29];
    /* 54 */ ProcPtr unk_proc;
};

struct ProcWorldFlush {
    PROC_HEADER;
    /* 29 */ u8 _pad_29[0x2C - 0x29];
    /* 2C */ u32 count;
};

struct ProcEventMapAnim {
    PROC_HEADER;
    /* 29 */ u8 _pad_29[0x4C - 0x29];
    /* 4C */ s16 timer;
    /* 4E */ u8 _pad_4E[0x52 - 0x4E];
    /* 52 */ u16 count;
    /* 54 */ u8 _pad_54[0x64 - 0x54];
    /* 64 */ s16 mode;
};

struct Proc89EEA28 {
    PROC_HEADER;
    /* 29 */ u8 _pad_29[0x4C - 0x29];
    /* 4C */ s16 timer;
    /* 4E */ u8 _pad_4E[0x52 - 0x4E];
    /* 52 */ u16 count;
    /* 54 */ u8 _pad_54[0x64 - 0x54];
    /* 64 */ s16 mode;
};

struct Unknown03000600 {
    u8 pid;
    s8 x;
    s8 y;

    u8 _pad_;
};

void EventCallGameOverExt(ProcPtr proc);
void GameOver_FadeOutCurrentBgm(ProcPtr proc);
void SkilGameOverForToturialExtraMap(ProcPtr proc);
void PostGameOverHandler(ProcPtr proc);
int CheckWaitAction_unused(void);
void UnsetKeyIgnoreMask(void);
void AsnycKeyStatus_ButtonB(void);
void NewForceAsyncButtonB(ProcPtr proc);
void HideAllAlliesExceptLeader(void);
void ResetAllPlayerUnitState(void);
// ??? TryLockParentProc(???);
// ??? TryUnlockParentProc(???);
// ??? ResetAllBG(???);
// ??? SwapUnitStatsChar100(???);
// ??? StartScreenFlashingWhite(???);
// ??? StartScreenFlashingRed(???);
// ??? BlackOutScreenWithBlend(???);
// ??? DisableAllDisplay(???);
// ??? EnableAllDisplay(???);
void EventQuakefxHorizon_ViolentLoop(struct Proc * proc);
void EventQuakefxHorizon_SlightLoop(struct Proc * proc);
void EventQuakefxVeritical_Loop(struct Proc * proc);
void StartEventVeriticalQuakefx(ProcPtr parent);
void StartEventHorizontalQuakefxViolently(ProcPtr parent);
void StartEventHorizontalQuakefxSlightly(ProcPtr parent);
void StartEventHorizontalQuakefxViolentlyNoSound(ProcPtr parent);
void StartEventHorizontalQuakefxSlightlyNoSound(ProcPtr parent);
void EndEventHorizontalQuakefx(ProcPtr parent);
void EndEventVerticalQuakefx(void);
void EventQuakefx_Init(struct Proc * proc);
void EventQuakefx_Loop(struct Proc * proc);
void StartEventQuakefx(ProcPtr proc);
void EndEventQuakefx(ProcPtr proc);
void SetEventId_0x84(ProcPtr);
void UnsetEventId_0x84(ProcPtr);

struct ProcUnitTornOut {
    PROC_HEADER;
    STRUCT_PAD(0x29, 0x4C);

    /* 4C */ s16 timer;

    STRUCT_PAD(0x4E, 0x54);

    /* 54 */ struct Unit * unit;
};

void UnitTornOut_Init(struct ProcUnitTornOut * proc);
void UnitTornOut_Loop(struct ProcUnitTornOut * proc);
void StartUnitTornOut(struct Unit * unit, ProcPtr parent);

void Nop_Eventcall_0(ProcPtr);
void WorldFlushInit(struct ProcWorldFlush * proc);
void WorldFlushOut(struct ProcWorldFlush * proc);
void WorldFlushReload(struct ProcWorldFlush * proc);
void WorldFlushIn(struct ProcWorldFlush * proc);
// ??? WorldFlushCallBack(???);
void StartWorldFlush(struct EventEngineProc * proc);
// ??? RecordGlobalSupportRankC(???);
// ??? RecordGlobalSupportRankB(???);
// ??? RecordGlobalSupportRankA(???);
void InitTowerDungeonState(struct EventEngineProc *proc);
void InitRuinsDungeonState(struct EventEngineProc *proc);
void DisplayMapClearMapAnim(ProcPtr proc);
void DisplayCongratulationsMapAnim(ProcPtr proc);
void DisplayEventMapAnim(ProcPtr, int);
void DrawEventMapAnimMaskfx(int, int);
// ??? DrawEventMapAnimMaskfxTsa(???);
// ??? EventMapAnim_Init(???);
